{"class_name": "Sequential", "keras_version": "1.1.2", "config": [{"class_name": "Convolution2D", "config": {"nb_row": 1, "bias": true, "name": "convolution2d_31", "nb_col": 1, "nb_filter": 3, "b_constraint": null, "subsample": [1, 1], "input_dtype": "float32", "activation": "relu", "b_regularizer": null, "activity_regularizer": null, "dim_ordering": "tf", "W_regularizer": null, "W_constraint": null, "trainable": true, "init": "he_normal", "border_mode": "same", "batch_input_shape": [null, 66, 200, 3]}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_14", "p": 0.2}}, {"class_name": "BatchNormalization", "config": {"mode": 0, "name": "batchnormalization_22", "momentum": 0.99, "epsilon": 0.001, "gamma_regularizer": null, "trainable": true, "axis": -1, "beta_regularizer": null}}, {"class_name": "Convolution2D", "config": {"nb_row": 5, "bias": true, "name": "convolution2d_32", "nb_col": 5, "nb_filter": 24, "b_constraint": null, "subsample": [2, 2], "border_mode": "valid", "activation": "linear", "activity_regularizer": null, "dim_ordering": "tf", "W_regularizer": null, "W_constraint": null, "trainable": true, "init": "he_normal", "b_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_15", "p": 0.2}}, {"class_name": "BatchNormalization", "config": {"mode": 0, "name": "batchnormalization_23", "momentum": 0.99, "epsilon": 0.001, "gamma_regularizer": null, "trainable": true, "axis": -1, "beta_regularizer": null}}, {"class_name": "Convolution2D", "config": {"nb_row": 5, "bias": true, "name": "convolution2d_33", "nb_col": 5, "nb_filter": 36, "b_constraint": null, "subsample": [2, 2], "border_mode": "valid", "activation": "linear", "activity_regularizer": null, "dim_ordering": "tf", "W_regularizer": null, "W_constraint": null, "trainable": true, "init": "he_normal", "b_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_16", "p": 0.2}}, {"class_name": "BatchNormalization", "config": {"mode": 0, "name": "batchnormalization_24", "momentum": 0.99, "epsilon": 0.001, "gamma_regularizer": null, "trainable": true, "axis": -1, "beta_regularizer": null}}, {"class_name": "Convolution2D", "config": {"nb_row": 5, "bias": true, "name": "convolution2d_34", "nb_col": 5, "nb_filter": 48, "b_constraint": null, "subsample": [2, 2], "border_mode": "valid", "activation": "linear", "activity_regularizer": null, "dim_ordering": "tf", "W_regularizer": null, "W_constraint": null, "trainable": true, "init": "he_normal", "b_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_17", "p": 0.2}}, {"class_name": "BatchNormalization", "config": {"mode": 0, "name": "batchnormalization_25", "momentum": 0.99, "epsilon": 0.001, "gamma_regularizer": null, "trainable": true, "axis": -1, "beta_regularizer": null}}, {"class_name": "Convolution2D", "config": {"nb_row": 3, "bias": true, "name": "convolution2d_35", "nb_col": 3, "nb_filter": 64, "b_constraint": null, "subsample": [1, 1], "border_mode": "valid", "activation": "linear", "activity_regularizer": null, "dim_ordering": "tf", "W_regularizer": null, "W_constraint": null, "trainable": true, "init": "he_normal", "b_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_18", "p": 0.2}}, {"class_name": "BatchNormalization", "config": {"mode": 0, "name": "batchnormalization_26", "momentum": 0.99, "epsilon": 0.001, "gamma_regularizer": null, "trainable": true, "axis": -1, "beta_regularizer": null}}, {"class_name": "Convolution2D", "config": {"nb_row": 3, "bias": true, "name": "convolution2d_36", "nb_col": 3, "nb_filter": 64, "b_constraint": null, "subsample": [1, 1], "border_mode": "valid", "activation": "linear", "activity_regularizer": null, "dim_ordering": "tf", "W_regularizer": null, "W_constraint": null, "trainable": true, "init": "he_normal", "b_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_19", "p": 0.2}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_6"}}, {"class_name": "Dense", "config": {"bias": true, "output_dim": 100, "name": "dense_21", "init": "he_normal", "activation": "relu", "activity_regularizer": null, "W_regularizer": null, "W_constraint": null, "input_dim": null, "trainable": true, "b_constraint": null, "b_regularizer": null}}, {"class_name": "Dense", "config": {"bias": true, "output_dim": 50, "name": "dense_22", "init": "he_normal", "activation": "relu", "activity_regularizer": null, "W_regularizer": null, "W_constraint": null, "input_dim": null, "trainable": true, "b_constraint": null, "b_regularizer": null}}, {"class_name": "Dense", "config": {"bias": true, "output_dim": 10, "name": "dense_23", "init": "he_normal", "activation": "relu", "activity_regularizer": null, "W_regularizer": null, "W_constraint": null, "input_dim": null, "trainable": true, "b_constraint": null, "b_regularizer": null}}, {"class_name": "Dense", "config": {"bias": true, "output_dim": 1, "name": "dense_24", "init": "he_normal", "activation": "linear", "activity_regularizer": null, "W_regularizer": null, "W_constraint": null, "input_dim": null, "trainable": true, "b_constraint": null, "b_regularizer": null}}]}