{"config": [{"config": {"function_type": "lambda", "input_dtype": "float32", "trainable": true, "name": "lambda_1", "output_shape_type": "raw", "batch_input_shape": [null, 64, 64, 3], "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0_@g\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00faH/home/hvrigazov/github/behavioral-cloning/models/small_image_pipeline.py\u00da\b<lambda>=\u0000\u0000\u0000\u00f3\u0000\u0000\u0000\u0000", null, null], "arguments": {}, "output_shape": null}, "class_name": "Lambda"}, {"config": {"nb_row": 5, "nb_col": 5, "subsample": [2, 2], "W_regularizer": null, "W_constraint": null, "border_mode": "same", "trainable": true, "nb_filter": 16, "b_regularizer": null, "batch_input_shape": [null, 64, 64, 3], "b_constraint": null, "dim_ordering": "tf", "bias": true, "activation": "linear", "init": "glorot_uniform", "activity_regularizer": null, "input_dtype": "float32", "name": "convolution2d_1"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_1"}, "class_name": "ELU"}, {"config": {"bias": true, "border_mode": "valid", "subsample": [1, 1], "W_regularizer": null, "W_constraint": null, "trainable": true, "nb_filter": 32, "b_regularizer": null, "nb_col": 3, "b_constraint": null, "dim_ordering": "tf", "nb_row": 3, "activation": "linear", "init": "glorot_uniform", "activity_regularizer": null, "name": "convolution2d_2"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_2"}, "class_name": "ELU"}, {"config": {"p": 0.5, "trainable": true, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "maxpooling2d_1", "pool_size": [2, 2], "dim_ordering": "tf", "border_mode": "valid", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"bias": true, "border_mode": "valid", "subsample": [1, 1], "W_regularizer": null, "W_constraint": null, "trainable": true, "nb_filter": 16, "b_regularizer": null, "nb_col": 3, "b_constraint": null, "dim_ordering": "tf", "nb_row": 3, "activation": "linear", "init": "glorot_uniform", "activity_regularizer": null, "name": "convolution2d_3"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_3"}, "class_name": "ELU"}, {"config": {"p": 0.5, "trainable": true, "name": "dropout_2"}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"name": "dense_1", "output_dim": 1024, "W_regularizer": null, "W_constraint": null, "input_dim": 2704, "trainable": true, "b_regularizer": null, "batch_input_shape": [null, 2704], "b_constraint": null, "bias": true, "activation": "linear", "init": "glorot_uniform", "activity_regularizer": null, "input_dtype": "float32"}, "class_name": "Dense"}, {"config": {"p": 0.3, "trainable": true, "name": "dropout_3"}, "class_name": "Dropout"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_4"}, "class_name": "ELU"}, {"config": {"name": "dense_2", "output_dim": 512, "W_regularizer": null, "W_constraint": null, "input_dim": 1024, "trainable": true, "b_regularizer": null, "batch_input_shape": [null, 1024], "b_constraint": null, "bias": true, "activation": "linear", "init": "glorot_uniform", "activity_regularizer": null, "input_dtype": "float32"}, "class_name": "Dense"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_5"}, "class_name": "ELU"}, {"config": {"name": "dense_3", "output_dim": 1, "W_regularizer": null, "W_constraint": null, "input_dim": 512, "trainable": true, "b_regularizer": null, "batch_input_shape": [null, 512], "b_constraint": null, "bias": true, "activation": "linear", "init": "glorot_uniform", "activity_regularizer": null, "input_dtype": "float32"}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.2.0"}