{"config": [{"config": {"trainable": true, "subsample": [2, 2], "nb_col": 3, "activity_regularizer": null, "name": "convolution2d_1", "b_regularizer": null, "border_mode": "same", "batch_input_shape": [null, 64, 64, 3], "activation": "linear", "input_dtype": "float32", "W_regularizer": null, "bias": true, "init": "glorot_uniform", "dim_ordering": "tf", "W_constraint": null, "nb_filter": 16, "b_constraint": null, "nb_row": 3}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_1"}, "class_name": "ELU"}, {"config": {"trainable": true, "subsample": [1, 1], "nb_col": 3, "activity_regularizer": null, "name": "convolution2d_2", "b_regularizer": null, "border_mode": "valid", "activation": "linear", "W_regularizer": null, "bias": true, "init": "glorot_uniform", "dim_ordering": "tf", "W_constraint": null, "nb_filter": 32, "b_constraint": null, "nb_row": 3}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_2"}, "class_name": "ELU"}, {"config": {"p": 0.5, "trainable": true, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"trainable": true, "strides": [2, 2], "dim_ordering": "tf", "name": "maxpooling2d_1", "pool_size": [2, 2], "border_mode": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "subsample": [1, 1], "nb_col": 3, "activity_regularizer": null, "name": "convolution2d_3", "b_regularizer": null, "border_mode": "valid", "activation": "linear", "W_regularizer": null, "bias": true, "init": "glorot_uniform", "dim_ordering": "tf", "W_constraint": null, "nb_filter": 16, "b_constraint": null, "nb_row": 3}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_3"}, "class_name": "ELU"}, {"config": {"p": 0.5, "trainable": true, "name": "dropout_2"}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"trainable": true, "activity_regularizer": null, "W_constraint": null, "W_regularizer": null, "activation": "linear", "output_dim": 1024, "bias": true, "init": "glorot_uniform", "b_constraint": null, "name": "dense_1", "input_dim": 2704, "b_regularizer": null}, "class_name": "Dense"}, {"config": {"p": 0.3, "trainable": true, "name": "dropout_3"}, "class_name": "Dropout"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_4"}, "class_name": "ELU"}, {"config": {"trainable": true, "activity_regularizer": null, "W_constraint": null, "W_regularizer": null, "activation": "linear", "output_dim": 512, "bias": true, "init": "glorot_uniform", "b_constraint": null, "name": "dense_2", "input_dim": 1024, "b_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_5"}, "class_name": "ELU"}, {"config": {"trainable": true, "activity_regularizer": null, "W_constraint": null, "W_regularizer": null, "activation": "linear", "output_dim": 1, "bias": true, "init": "glorot_uniform", "b_constraint": null, "name": "dense_3", "input_dim": 512, "b_regularizer": null}, "class_name": "Dense"}], "keras_version": "1.2.1", "class_name": "Sequential"}