{"class_name": "Sequential", "keras_version": "1.2.1", "config": [{"class_name": "Convolution2D", "config": {"nb_filter": 16, "nb_col": 5, "name": "convolution2d_1", "input_dtype": "float32", "activation": "linear", "bias": true, "batch_input_shape": [null, 64, 42, 3], "subsample": [2, 2], "nb_row": 5, "border_mode": "same", "activity_regularizer": null, "W_constraint": null, "init": "glorot_uniform", "W_regularizer": null, "trainable": true, "b_regularizer": null, "dim_ordering": "tf", "b_constraint": null}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_1", "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"nb_filter": 32, "nb_col": 3, "name": "convolution2d_2", "nb_row": 3, "activation": "linear", "bias": true, "subsample": [1, 1], "border_mode": "valid", "activity_regularizer": null, "W_constraint": null, "init": "glorot_uniform", "W_regularizer": null, "trainable": true, "b_regularizer": null, "dim_ordering": "tf", "b_constraint": null}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_2", "alpha": 1.0}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_1"}}, {"class_name": "MaxPooling2D", "config": {"border_mode": "valid", "name": "maxpooling2d_1", "strides": [2, 2], "pool_size": [2, 2], "trainable": true, "dim_ordering": "tf"}}, {"class_name": "Convolution2D", "config": {"nb_filter": 16, "nb_col": 3, "name": "convolution2d_3", "nb_row": 3, "activation": "linear", "bias": true, "subsample": [1, 1], "border_mode": "valid", "activity_regularizer": null, "W_constraint": null, "init": "glorot_uniform", "W_regularizer": null, "trainable": true, "b_regularizer": null, "dim_ordering": "tf", "b_constraint": null}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_3", "alpha": 1.0}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_2"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"name": "dense_1", "bias": true, "output_dim": 1024, "activity_regularizer": null, "W_constraint": null, "init": "glorot_uniform", "W_regularizer": null, "trainable": true, "b_regularizer": null, "input_dim": 1456, "b_constraint": null, "activation": "linear"}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.3, "name": "dropout_3"}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_4", "alpha": 1.0}}, {"class_name": "Dense", "config": {"name": "dense_2", "bias": true, "output_dim": 512, "activity_regularizer": null, "W_constraint": null, "init": "glorot_uniform", "W_regularizer": null, "trainable": true, "b_regularizer": null, "input_dim": 1024, "b_constraint": null, "activation": "linear"}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_5", "alpha": 1.0}}, {"class_name": "Dense", "config": {"name": "dense_3", "bias": true, "output_dim": 1, "activity_regularizer": null, "W_constraint": null, "init": "glorot_uniform", "W_regularizer": null, "trainable": true, "b_regularizer": null, "input_dim": 512, "b_constraint": null, "activation": "linear"}}]}