{"class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\b\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bS)\u0002Ng\u0000\u0000\u0000\u0000\u0000\u00e0o@\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa8/home/carnd/behavioral-cloning/models/nvidia_pipeline.py\u00da\b<lambda>2\u0000\u0000\u0000\u00f3\u0000\u0000\u0000\u0000", null, null], "batch_input_shape": [null, 30, 40, 3], "output_shape_type": "raw", "trainable": true, "function_type": "lambda", "name": "lambda_1", "arguments": {}, "output_shape": null, "input_dtype": "float32"}}, {"class_name": "Convolution2D", "config": {"activation": "linear", "W_regularizer": {"name": "L1L2Regularizer", "l2": 9.999999747378752e-06, "l1": 0.0}, "bias": true, "name": "convolution2d_1", "nb_col": 3, "activity_regularizer": {"name": "L1L2Regularizer", "l2": 9.999999747378752e-06, "l1": 0.0}, "subsample": [2, 2], "W_constraint": null, "dim_ordering": "tf", "trainable": true, "border_mode": "valid", "nb_row": 3, "nb_filter": 36, "b_constraint": null, "init": "he_normal", "b_regularizer": null}}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "mode": 0, "trainable": true, "axis": -1, "name": "batchnormalization_1", "momentum": 0.99, "beta_regularizer": null, "gamma_regularizer": null}}, {"class_name": "Convolution2D", "config": {"activation": "linear", "W_regularizer": {"name": "L1L2Regularizer", "l2": 9.999999747378752e-06, "l1": 0.0}, "bias": true, "name": "convolution2d_2", "nb_col": 3, "activity_regularizer": {"name": "L1L2Regularizer", "l2": 9.999999747378752e-06, "l1": 0.0}, "subsample": [2, 2], "W_constraint": null, "dim_ordering": "tf", "trainable": true, "border_mode": "valid", "nb_row": 3, "nb_filter": 48, "b_constraint": null, "init": "he_normal", "b_regularizer": null}}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "mode": 0, "trainable": true, "axis": -1, "name": "batchnormalization_2", "momentum": 0.99, "beta_regularizer": null, "gamma_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "p": 0.3}}, {"class_name": "Convolution2D", "config": {"activation": "linear", "W_regularizer": {"name": "L1L2Regularizer", "l2": 9.999999747378752e-06, "l1": 0.0}, "bias": true, "name": "convolution2d_3", "nb_col": 3, "activity_regularizer": {"name": "L1L2Regularizer", "l2": 9.999999747378752e-06, "l1": 0.0}, "subsample": [1, 1], "W_constraint": null, "dim_ordering": "tf", "trainable": true, "border_mode": "valid", "nb_row": 3, "nb_filter": 64, "b_constraint": null, "init": "he_normal", "b_regularizer": null}}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "mode": 0, "trainable": true, "axis": -1, "name": "batchnormalization_3", "momentum": 0.99, "beta_regularizer": null, "gamma_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "p": 0.4}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"activation": "relu", "W_regularizer": null, "bias": true, "name": "dense_1", "W_constraint": null, "activity_regularizer": null, "output_dim": 100, "trainable": true, "input_dim": 1792, "b_constraint": null, "init": "he_normal", "b_regularizer": null}}, {"class_name": "Dense", "config": {"activation": "relu", "W_regularizer": null, "bias": true, "name": "dense_2", "W_constraint": null, "activity_regularizer": null, "output_dim": 50, "trainable": true, "input_dim": 100, "b_constraint": null, "init": "he_normal", "b_regularizer": null}}, {"class_name": "Dense", "config": {"activation": "relu", "W_regularizer": null, "bias": true, "name": "dense_3", "W_constraint": null, "activity_regularizer": null, "output_dim": 10, "trainable": true, "input_dim": 50, "b_constraint": null, "init": "he_normal", "b_regularizer": null}}, {"class_name": "Dense", "config": {"activation": "linear", "W_regularizer": null, "bias": true, "name": "dense_4", "W_constraint": null, "activity_regularizer": null, "output_dim": 1, "trainable": true, "input_dim": 10, "b_constraint": null, "init": "he_normal", "b_regularizer": null}}], "keras_version": "1.2.1"}