{"config": [{"config": {"trainable": true, "init": "glorot_uniform", "input_dtype": "float32", "dim_ordering": "tf", "nb_row": 5, "W_regularizer": null, "activation": "linear", "nb_col": 5, "subsample": [2, 2], "border_mode": "same", "batch_input_shape": [null, 64, 64, 3], "name": "convolution2d_1", "activity_regularizer": null, "nb_filter": 32, "b_constraint": null, "W_constraint": null, "b_regularizer": null, "bias": true}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_1"}, "class_name": "ELU"}, {"config": {"trainable": true, "init": "glorot_uniform", "nb_row": 3, "dim_ordering": "tf", "W_regularizer": null, "activation": "linear", "nb_col": 3, "subsample": [1, 1], "b_constraint": null, "border_mode": "valid", "activity_regularizer": null, "nb_filter": 16, "W_constraint": null, "b_regularizer": null, "name": "convolution2d_2", "bias": true}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_2"}, "class_name": "ELU"}, {"config": {"trainable": true, "p": 0.4, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"trainable": true, "strides": [2, 2], "dim_ordering": "tf", "pool_size": [2, 2], "border_mode": "valid", "name": "maxpooling2d_1"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "init": "glorot_uniform", "nb_row": 3, "dim_ordering": "tf", "W_regularizer": null, "activation": "linear", "nb_col": 3, "subsample": [1, 1], "b_constraint": null, "border_mode": "valid", "activity_regularizer": null, "nb_filter": 16, "W_constraint": null, "b_regularizer": null, "name": "convolution2d_3", "bias": true}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_3"}, "class_name": "ELU"}, {"config": {"trainable": true, "p": 0.4, "name": "dropout_2"}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"trainable": true, "init": "glorot_uniform", "W_constraint": null, "activation": "linear", "b_constraint": null, "name": "dense_1", "activity_regularizer": null, "W_regularizer": null, "b_regularizer": null, "input_dim": 2704, "output_dim": 1024, "bias": true}, "class_name": "Dense"}, {"config": {"trainable": true, "p": 0.3, "name": "dropout_3"}, "class_name": "Dropout"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_4"}, "class_name": "ELU"}, {"config": {"trainable": true, "init": "glorot_uniform", "W_constraint": null, "activation": "linear", "b_constraint": null, "name": "dense_2", "activity_regularizer": null, "W_regularizer": null, "b_regularizer": null, "input_dim": 1024, "output_dim": 512, "bias": true}, "class_name": "Dense"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_5"}, "class_name": "ELU"}, {"config": {"trainable": true, "init": "glorot_uniform", "W_constraint": null, "activation": "linear", "b_constraint": null, "name": "dense_3", "activity_regularizer": null, "W_regularizer": null, "b_regularizer": null, "input_dim": 512, "output_dim": 1, "bias": true}, "class_name": "Dense"}], "keras_version": "1.2.1", "class_name": "Sequential"}