{"keras_version": "1.2.1", "config": [{"config": {"input_dtype": "float32", "activity_regularizer": null, "b_regularizer": null, "nb_row": 5, "W_regularizer": null, "init": "glorot_uniform", "nb_filter": 16, "W_constraint": null, "bias": true, "b_constraint": null, "activation": "linear", "border_mode": "same", "batch_input_shape": [null, 64, 42, 3], "subsample": [2, 2], "name": "convolution2d_1", "nb_col": 5, "trainable": true, "dim_ordering": "tf"}, "class_name": "Convolution2D"}, {"config": {"alpha": 1.0, "name": "elu_1", "trainable": true}, "class_name": "ELU"}, {"config": {"activity_regularizer": null, "nb_col": 3, "nb_row": 3, "W_regularizer": null, "init": "glorot_uniform", "nb_filter": 16, "W_constraint": null, "bias": true, "b_constraint": null, "activation": "linear", "border_mode": "valid", "name": "convolution2d_2", "subsample": [1, 1], "b_regularizer": null, "trainable": true, "dim_ordering": "tf"}, "class_name": "Convolution2D"}, {"config": {"alpha": 1.0, "name": "elu_2", "trainable": true}, "class_name": "ELU"}, {"config": {"p": 0.5, "name": "dropout_1", "trainable": true}, "class_name": "Dropout"}, {"config": {"pool_size": [2, 2], "border_mode": "valid", "name": "maxpooling2d_1", "strides": [2, 2], "dim_ordering": "tf", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"activity_regularizer": null, "nb_col": 3, "nb_row": 3, "W_regularizer": null, "init": "glorot_uniform", "nb_filter": 16, "W_constraint": null, "bias": true, "b_constraint": null, "activation": "linear", "border_mode": "valid", "name": "convolution2d_3", "subsample": [1, 1], "b_regularizer": null, "trainable": true, "dim_ordering": "tf"}, "class_name": "Convolution2D"}, {"config": {"alpha": 1.0, "name": "elu_3", "trainable": true}, "class_name": "ELU"}, {"config": {"p": 0.5, "name": "dropout_2", "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"activity_regularizer": null, "output_dim": 1024, "W_regularizer": null, "init": "glorot_uniform", "trainable": true, "W_constraint": null, "input_dim": 1456, "b_constraint": null, "bias": true, "name": "dense_1", "b_regularizer": null, "activation": "linear"}, "class_name": "Dense"}, {"config": {"p": 0.3, "name": "dropout_3", "trainable": true}, "class_name": "Dropout"}, {"config": {"alpha": 1.0, "name": "elu_4", "trainable": true}, "class_name": "ELU"}, {"config": {"activity_regularizer": null, "output_dim": 512, "W_regularizer": null, "init": "glorot_uniform", "trainable": true, "W_constraint": null, "input_dim": 1024, "b_constraint": null, "bias": true, "name": "dense_2", "b_regularizer": null, "activation": "linear"}, "class_name": "Dense"}, {"config": {"alpha": 1.0, "name": "elu_5", "trainable": true}, "class_name": "ELU"}, {"config": {"activity_regularizer": null, "output_dim": 1, "W_regularizer": null, "init": "glorot_uniform", "trainable": true, "W_constraint": null, "input_dim": 512, "b_constraint": null, "bias": true, "name": "dense_3", "b_regularizer": null, "activation": "linear"}, "class_name": "Dense"}], "class_name": "Sequential"}