{"keras_version": "1.2.1", "class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"output_shape_type": "raw", "name": "lambda_1", "output_shape": null, "batch_input_shape": [null, 64, 64, 3], "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0_@g\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa8/home/carnd/behavioral-cloning/models/nvidia_pipeline.py\u00da\b<lambda>5\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "arguments": {}, "trainable": true, "input_dtype": "float32", "function_type": "lambda"}}, {"class_name": "Convolution2D", "config": {"nb_col": 5, "init": "glorot_uniform", "nb_row": 5, "bias": true, "border_mode": "same", "b_regularizer": null, "trainable": true, "activity_regularizer": null, "W_regularizer": null, "name": "convolution2d_1", "activation": "linear", "b_constraint": null, "W_constraint": null, "subsample": [2, 2], "nb_filter": 24, "dim_ordering": "tf"}}, {"class_name": "Activation", "config": {"name": "activation_1", "activation": "relu", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"strides": [1, 1], "name": "maxpooling2d_1", "border_mode": "valid", "trainable": true, "pool_size": [2, 2], "dim_ordering": "tf"}}, {"class_name": "Convolution2D", "config": {"nb_col": 5, "init": "glorot_uniform", "nb_row": 5, "bias": true, "border_mode": "same", "b_regularizer": null, "trainable": true, "activity_regularizer": null, "W_regularizer": null, "name": "convolution2d_2", "activation": "linear", "b_constraint": null, "W_constraint": null, "subsample": [2, 2], "nb_filter": 36, "dim_ordering": "tf"}}, {"class_name": "Activation", "config": {"name": "activation_2", "activation": "relu", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"strides": [1, 1], "name": "maxpooling2d_2", "border_mode": "valid", "trainable": true, "pool_size": [2, 2], "dim_ordering": "tf"}}, {"class_name": "Convolution2D", "config": {"nb_col": 5, "init": "glorot_uniform", "nb_row": 5, "bias": true, "border_mode": "same", "b_regularizer": null, "trainable": true, "activity_regularizer": null, "W_regularizer": null, "name": "convolution2d_3", "activation": "linear", "b_constraint": null, "W_constraint": null, "subsample": [2, 2], "nb_filter": 48, "dim_ordering": "tf"}}, {"class_name": "Activation", "config": {"name": "activation_3", "activation": "relu", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"strides": [1, 1], "name": "maxpooling2d_3", "border_mode": "valid", "trainable": true, "pool_size": [2, 2], "dim_ordering": "tf"}}, {"class_name": "Convolution2D", "config": {"nb_col": 3, "init": "glorot_uniform", "nb_row": 3, "bias": true, "border_mode": "same", "b_regularizer": null, "trainable": true, "activity_regularizer": null, "W_regularizer": null, "name": "convolution2d_4", "activation": "linear", "b_constraint": null, "W_constraint": null, "subsample": [1, 1], "nb_filter": 64, "dim_ordering": "tf"}}, {"class_name": "Activation", "config": {"name": "activation_4", "activation": "relu", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"strides": [1, 1], "name": "maxpooling2d_4", "border_mode": "valid", "trainable": true, "pool_size": [2, 2], "dim_ordering": "tf"}}, {"class_name": "Convolution2D", "config": {"nb_col": 3, "init": "glorot_uniform", "nb_row": 3, "bias": true, "border_mode": "same", "b_regularizer": null, "trainable": true, "activity_regularizer": null, "W_regularizer": null, "name": "convolution2d_5", "activation": "linear", "b_constraint": null, "W_constraint": null, "subsample": [1, 1], "nb_filter": 64, "dim_ordering": "tf"}}, {"class_name": "Activation", "config": {"name": "activation_5", "activation": "relu", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"strides": [1, 1], "name": "maxpooling2d_5", "border_mode": "valid", "trainable": true, "pool_size": [2, 2], "dim_ordering": "tf"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "bias": true, "name": "dense_1", "b_regularizer": null, "trainable": true, "activity_regularizer": null, "W_regularizer": null, "output_dim": 1164, "input_dim": 1600, "activation": "linear", "b_constraint": null, "W_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_6", "activation": "relu", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "p": 0.3, "trainable": true}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "bias": true, "name": "dense_2", "b_regularizer": null, "trainable": true, "activity_regularizer": null, "W_regularizer": null, "output_dim": 100, "input_dim": 1164, "activation": "linear", "b_constraint": null, "W_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_7", "activation": "relu", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "p": 0.4, "trainable": true}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "bias": true, "name": "dense_3", "b_regularizer": null, "trainable": true, "activity_regularizer": null, "W_regularizer": null, "output_dim": 50, "input_dim": 100, "activation": "linear", "b_constraint": null, "W_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_8", "activation": "relu", "trainable": true}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "bias": true, "name": "dense_4", "b_regularizer": null, "trainable": true, "activity_regularizer": null, "W_regularizer": null, "output_dim": 10, "input_dim": 50, "activation": "linear", "b_constraint": null, "W_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_9", "activation": "relu", "trainable": true}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "bias": true, "name": "dense_5", "b_regularizer": null, "trainable": true, "activity_regularizer": null, "W_regularizer": null, "output_dim": 1, "input_dim": 10, "activation": "linear", "b_constraint": null, "W_constraint": null}}]}