{"keras_version": "1.2.0", "config": [{"config": {"b_regularizer": null, "W_constraint": null, "subsample": [1, 1], "border_mode": "same", "trainable": true, "activity_regularizer": null, "nb_col": 1, "dim_ordering": "tf", "b_constraint": null, "batch_input_shape": [null, 160, 320, 3], "W_regularizer": null, "activation": "relu", "name": "convolution2d_14", "nb_filter": 3, "input_dtype": "float32", "nb_row": 1, "bias": true, "init": "glorot_uniform"}, "class_name": "Convolution2D"}, {"config": {"b_regularizer": null, "W_constraint": null, "subsample": [2, 2], "border_mode": "valid", "trainable": true, "activity_regularizer": null, "nb_col": 5, "dim_ordering": "tf", "b_constraint": null, "W_regularizer": null, "activation": "relu", "name": "convolution2d_15", "nb_filter": 24, "nb_row": 5, "bias": true, "init": "glorot_uniform"}, "class_name": "Convolution2D"}, {"config": {"b_regularizer": null, "W_constraint": null, "subsample": [2, 2], "border_mode": "valid", "trainable": true, "activity_regularizer": null, "nb_col": 5, "dim_ordering": "tf", "b_constraint": null, "W_regularizer": null, "activation": "relu", "name": "convolution2d_16", "nb_filter": 36, "nb_row": 5, "bias": true, "init": "glorot_uniform"}, "class_name": "Convolution2D"}, {"config": {"b_regularizer": null, "W_constraint": null, "subsample": [2, 2], "border_mode": "valid", "trainable": true, "activity_regularizer": null, "nb_col": 5, "dim_ordering": "tf", "b_constraint": null, "W_regularizer": null, "activation": "relu", "name": "convolution2d_17", "nb_filter": 48, "nb_row": 5, "bias": true, "init": "glorot_uniform"}, "class_name": "Convolution2D"}, {"config": {"b_regularizer": null, "W_constraint": null, "subsample": [1, 1], "border_mode": "valid", "trainable": true, "activity_regularizer": null, "nb_col": 3, "dim_ordering": "tf", "b_constraint": null, "W_regularizer": null, "activation": "relu", "name": "convolution2d_18", "nb_filter": 64, "nb_row": 3, "bias": true, "init": "glorot_uniform"}, "class_name": "Convolution2D"}, {"config": {"b_regularizer": null, "W_constraint": null, "subsample": [1, 1], "border_mode": "valid", "trainable": true, "activity_regularizer": null, "nb_col": 3, "dim_ordering": "tf", "b_constraint": null, "W_regularizer": null, "activation": "relu", "name": "convolution2d_19", "nb_filter": 80, "nb_row": 3, "bias": true, "init": "glorot_uniform"}, "class_name": "Convolution2D"}, {"config": {"b_regularizer": null, "W_constraint": null, "subsample": [1, 1], "border_mode": "valid", "trainable": true, "activity_regularizer": null, "nb_col": 3, "dim_ordering": "tf", "b_constraint": null, "W_regularizer": null, "activation": "relu", "name": "convolution2d_20", "nb_filter": 96, "nb_row": 3, "bias": true, "init": "glorot_uniform"}, "class_name": "Convolution2D"}, {"config": {"b_regularizer": null, "W_constraint": null, "subsample": [1, 1], "border_mode": "valid", "trainable": true, "activity_regularizer": null, "nb_col": 3, "dim_ordering": "tf", "b_constraint": null, "W_regularizer": null, "activation": "relu", "name": "convolution2d_21", "nb_filter": 112, "nb_row": 3, "bias": true, "init": "glorot_uniform"}, "class_name": "Convolution2D"}, {"config": {"b_regularizer": null, "W_constraint": null, "subsample": [1, 1], "border_mode": "valid", "trainable": true, "activity_regularizer": null, "nb_col": 3, "dim_ordering": "tf", "b_constraint": null, "W_regularizer": null, "activation": "relu", "name": "convolution2d_22", "nb_filter": 128, "nb_row": 3, "bias": true, "init": "glorot_uniform"}, "class_name": "Convolution2D"}, {"config": {"b_regularizer": null, "W_constraint": null, "subsample": [1, 1], "border_mode": "valid", "trainable": true, "activity_regularizer": null, "nb_col": 3, "dim_ordering": "tf", "b_constraint": null, "W_regularizer": null, "activation": "relu", "name": "convolution2d_23", "nb_filter": 144, "nb_row": 3, "bias": true, "init": "glorot_uniform"}, "class_name": "Convolution2D"}, {"config": {"b_regularizer": null, "W_constraint": null, "subsample": [1, 1], "border_mode": "valid", "trainable": true, "activity_regularizer": null, "nb_col": 3, "dim_ordering": "tf", "b_constraint": null, "W_regularizer": null, "activation": "relu", "name": "convolution2d_24", "nb_filter": 160, "nb_row": 3, "bias": true, "init": "glorot_uniform"}, "class_name": "Convolution2D"}, {"config": {"b_regularizer": null, "W_constraint": null, "subsample": [1, 1], "border_mode": "valid", "trainable": true, "activity_regularizer": null, "nb_col": 3, "dim_ordering": "tf", "b_constraint": null, "W_regularizer": null, "activation": "relu", "name": "convolution2d_25", "nb_filter": 176, "nb_row": 3, "bias": true, "init": "glorot_uniform"}, "class_name": "Convolution2D"}, {"config": {"name": "flatten_2", "trainable": true}, "class_name": "Flatten"}, {"config": {"b_regularizer": null, "W_constraint": null, "trainable": true, "activity_regularizer": null, "input_dim": 3696, "W_regularizer": null, "activation": "relu", "name": "dense_5", "output_dim": 256, "b_constraint": null, "bias": true, "init": "glorot_uniform"}, "class_name": "Dense"}, {"config": {"b_regularizer": null, "W_constraint": null, "trainable": true, "activity_regularizer": null, "input_dim": 256, "W_regularizer": null, "activation": "relu", "name": "dense_6", "output_dim": 128, "b_constraint": null, "bias": true, "init": "glorot_uniform"}, "class_name": "Dense"}, {"config": {"b_regularizer": null, "W_constraint": null, "trainable": true, "activity_regularizer": null, "input_dim": 128, "W_regularizer": null, "activation": "relu", "name": "dense_7", "output_dim": 32, "b_constraint": null, "bias": true, "init": "glorot_uniform"}, "class_name": "Dense"}, {"config": {"b_regularizer": null, "W_constraint": null, "trainable": true, "activity_regularizer": null, "input_dim": 32, "W_regularizer": null, "activation": "relu", "name": "dense_8", "output_dim": 1, "b_constraint": null, "bias": true, "init": "glorot_uniform"}, "class_name": "Dense"}], "class_name": "Sequential"}