{"class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"name": "lambda_1", "batch_input_shape": [null, 22, 64, 1], "input_dtype": "float32", "function_type": "lambda", "trainable": true, "output_shape": null, "arguments": {}, "output_shape_type": "raw", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0o@g\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00faE/home/hvrigazov/github/behavioral-cloning/models/comma_ai_pipeline.py\u00da\b<lambda>F\u0000\u0000\u0000\u00f3\u0000\u0000\u0000\u0000", null, null]}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_1", "W_constraint": null, "dim_ordering": "tf", "trainable": true, "activity_regularizer": null, "nb_col": 3, "subsample": [2, 2], "bias": true, "b_constraint": null, "activation": "linear", "b_regularizer": null, "init": "glorot_uniform", "nb_filter": 16, "W_regularizer": null, "border_mode": "same", "nb_row": 3}}, {"class_name": "ELU", "config": {"name": "elu_1", "trainable": true, "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_2", "W_constraint": null, "dim_ordering": "tf", "trainable": true, "activity_regularizer": null, "nb_col": 3, "subsample": [1, 1], "bias": true, "b_constraint": null, "activation": "linear", "b_regularizer": null, "init": "glorot_uniform", "nb_filter": 8, "W_regularizer": null, "border_mode": "same", "nb_row": 3}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_1", "strides": [2, 2], "dim_ordering": "tf", "trainable": true, "pool_size": [2, 2], "border_mode": "valid"}}, {"class_name": "ELU", "config": {"name": "elu_2", "trainable": true, "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_3", "W_constraint": null, "dim_ordering": "tf", "trainable": true, "activity_regularizer": null, "nb_col": 3, "subsample": [1, 1], "bias": true, "b_constraint": null, "activation": "linear", "b_regularizer": null, "init": "glorot_uniform", "nb_filter": 4, "W_regularizer": null, "border_mode": "same", "nb_row": 3}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "p": 0.2, "trainable": true}}, {"class_name": "Dense", "config": {"input_dim": 320, "name": "dense_1", "batch_input_shape": [null, 320], "activity_regularizer": null, "trainable": true, "W_constraint": null, "output_dim": 512, "bias": true, "b_constraint": null, "init": "glorot_uniform", "b_regularizer": null, "input_dtype": "float32", "W_regularizer": null, "activation": "linear"}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "p": 0.4, "trainable": true}}, {"class_name": "ELU", "config": {"name": "elu_3", "trainable": true, "alpha": 1.0}}, {"class_name": "Dense", "config": {"input_dim": 512, "name": "dense_2", "batch_input_shape": [null, 512], "activity_regularizer": null, "trainable": true, "W_constraint": null, "output_dim": 1, "bias": true, "b_constraint": null, "init": "glorot_uniform", "b_regularizer": null, "input_dtype": "float32", "W_regularizer": null, "activation": "linear"}}], "keras_version": "1.2.0"}