{"class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"b_constraint": null, "dim_ordering": "tf", "init": "he_normal", "subsample": [1, 1], "nb_col": 1, "nb_row": 1, "name": "convolution2d_25", "trainable": true, "border_mode": "same", "activity_regularizer": null, "activation": "relu", "batch_input_shape": [null, 66, 200, 3], "nb_filter": 3, "W_regularizer": null, "bias": true, "input_dtype": "float32", "b_regularizer": null, "W_constraint": null}}, {"class_name": "BatchNormalization", "config": {"axis": -1, "gamma_regularizer": null, "beta_regularizer": null, "name": "batchnormalization_5", "trainable": true, "epsilon": 0.001, "momentum": 0.99, "mode": 0}}, {"class_name": "Convolution2D", "config": {"b_constraint": null, "dim_ordering": "tf", "init": "he_normal", "subsample": [2, 2], "nb_col": 5, "nb_row": 5, "name": "convolution2d_26", "trainable": true, "border_mode": "valid", "activity_regularizer": null, "activation": "linear", "nb_filter": 24, "W_regularizer": null, "bias": true, "b_regularizer": null, "W_constraint": null}}, {"class_name": "Convolution2D", "config": {"b_constraint": null, "dim_ordering": "tf", "init": "he_normal", "subsample": [2, 2], "nb_col": 5, "nb_row": 5, "name": "convolution2d_27", "trainable": true, "border_mode": "valid", "activity_regularizer": null, "activation": "linear", "nb_filter": 36, "W_regularizer": null, "bias": true, "b_regularizer": null, "W_constraint": null}}, {"class_name": "Convolution2D", "config": {"b_constraint": null, "dim_ordering": "tf", "init": "he_normal", "subsample": [2, 2], "nb_col": 5, "nb_row": 5, "name": "convolution2d_28", "trainable": true, "border_mode": "valid", "activity_regularizer": null, "activation": "linear", "nb_filter": 48, "W_regularizer": null, "bias": true, "b_regularizer": null, "W_constraint": null}}, {"class_name": "Convolution2D", "config": {"b_constraint": null, "dim_ordering": "tf", "init": "he_normal", "subsample": [1, 1], "nb_col": 3, "nb_row": 3, "name": "convolution2d_29", "trainable": true, "border_mode": "valid", "activity_regularizer": null, "activation": "linear", "nb_filter": 64, "W_regularizer": null, "bias": true, "b_regularizer": null, "W_constraint": null}}, {"class_name": "Convolution2D", "config": {"b_constraint": null, "dim_ordering": "tf", "init": "he_normal", "subsample": [1, 1], "nb_col": 3, "nb_row": 3, "name": "convolution2d_30", "trainable": true, "border_mode": "valid", "activity_regularizer": null, "activation": "linear", "nb_filter": 64, "W_regularizer": null, "bias": true, "b_regularizer": null, "W_constraint": null}}, {"class_name": "Flatten", "config": {"name": "flatten_5", "trainable": true}}, {"class_name": "Dense", "config": {"b_constraint": null, "init": "he_normal", "W_regularizer": null, "name": "dense_17", "trainable": true, "output_dim": 100, "activity_regularizer": null, "activation": "relu", "input_dim": null, "bias": true, "b_regularizer": null, "W_constraint": null}}, {"class_name": "Dense", "config": {"b_constraint": null, "init": "he_normal", "W_regularizer": null, "name": "dense_18", "trainable": true, "output_dim": 50, "activity_regularizer": null, "activation": "relu", "input_dim": null, "bias": true, "b_regularizer": null, "W_constraint": null}}, {"class_name": "Dense", "config": {"b_constraint": null, "init": "he_normal", "W_regularizer": null, "name": "dense_19", "trainable": true, "output_dim": 10, "activity_regularizer": null, "activation": "relu", "input_dim": null, "bias": true, "b_regularizer": null, "W_constraint": null}}, {"class_name": "Dense", "config": {"b_constraint": null, "init": "he_normal", "W_regularizer": null, "name": "dense_20", "trainable": true, "output_dim": 1, "activity_regularizer": null, "activation": "linear", "input_dim": null, "bias": true, "b_regularizer": null, "W_constraint": null}}], "keras_version": "1.1.2"}