{"class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"trainable": true, "b_constraint": null, "nb_row": 3, "W_constraint": null, "dim_ordering": "tf", "nb_filter": 32, "border_mode": "same", "activity_regularizer": null, "input_dtype": "float32", "W_regularizer": null, "subsample": [2, 2], "batch_input_shape": [null, 32, 32, 3], "activation": "linear", "bias": true, "name": "convolution2d_1", "b_regularizer": null, "init": "glorot_uniform", "nb_col": 3}}, {"class_name": "ELU", "config": {"name": "elu_1", "alpha": 1.0, "trainable": true}}, {"class_name": "Convolution2D", "config": {"trainable": true, "b_constraint": null, "nb_row": 3, "W_constraint": null, "dim_ordering": "tf", "nb_filter": 16, "border_mode": "valid", "activity_regularizer": null, "nb_col": 3, "W_regularizer": null, "subsample": [1, 1], "init": "glorot_uniform", "activation": "linear", "bias": true, "name": "convolution2d_2", "b_regularizer": null}}, {"class_name": "ELU", "config": {"name": "elu_2", "alpha": 1.0, "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "p": 0.4, "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_1", "dim_ordering": "tf", "strides": [2, 2], "border_mode": "valid", "trainable": true, "pool_size": [2, 2]}}, {"class_name": "Convolution2D", "config": {"trainable": true, "b_constraint": null, "nb_row": 3, "W_constraint": null, "dim_ordering": "tf", "nb_filter": 16, "border_mode": "valid", "activity_regularizer": null, "nb_col": 3, "W_regularizer": null, "subsample": [1, 1], "init": "glorot_uniform", "activation": "linear", "bias": true, "name": "convolution2d_3", "b_regularizer": null}}, {"class_name": "ELU", "config": {"name": "elu_3", "alpha": 1.0, "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "p": 0.4, "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"b_constraint": null, "W_constraint": null, "bias": true, "activity_regularizer": null, "W_regularizer": null, "init": "glorot_uniform", "activation": "linear", "trainable": true, "name": "dense_1", "output_dim": 1024, "b_regularizer": null, "input_dim": 400}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "p": 0.3, "trainable": true}}, {"class_name": "ELU", "config": {"name": "elu_4", "alpha": 1.0, "trainable": true}}, {"class_name": "Dense", "config": {"b_constraint": null, "W_constraint": null, "bias": true, "activity_regularizer": null, "W_regularizer": null, "init": "glorot_uniform", "activation": "linear", "trainable": true, "name": "dense_2", "output_dim": 512, "b_regularizer": null, "input_dim": 1024}}, {"class_name": "ELU", "config": {"name": "elu_5", "alpha": 1.0, "trainable": true}}, {"class_name": "Dense", "config": {"b_constraint": null, "W_constraint": null, "bias": true, "activity_regularizer": null, "W_regularizer": null, "init": "glorot_uniform", "activation": "linear", "trainable": true, "name": "dense_3", "output_dim": 1, "b_regularizer": null, "input_dim": 512}}], "keras_version": "1.2.1"}