{"class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"arguments": {}, "input_dtype": "float32", "batch_input_shape": [null, 64, 64, 3], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "trainable": true, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0_@g\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00faH/home/hvrigazov/github/behavioral-cloning/models/small_image_pipeline.py\u00da\b<lambda>=\u0000\u0000\u0000\u00f3\u0000\u0000\u0000\u0000", null, null], "name": "lambda_1"}}, {"class_name": "Convolution2D", "config": {"nb_row": 5, "W_regularizer": null, "batch_input_shape": [null, 64, 64, 3], "b_constraint": null, "border_mode": "same", "W_constraint": null, "init": "glorot_uniform", "dim_ordering": "tf", "input_dtype": "float32", "activity_regularizer": null, "name": "convolution2d_1", "subsample": [2, 2], "nb_filter": 16, "activation": "linear", "trainable": true, "b_regularizer": null, "nb_col": 5, "bias": true}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_1"}}, {"class_name": "Convolution2D", "config": {"nb_row": 3, "W_regularizer": null, "b_constraint": null, "border_mode": "valid", "W_constraint": null, "init": "glorot_uniform", "dim_ordering": "tf", "activity_regularizer": null, "name": "convolution2d_2", "subsample": [1, 1], "nb_filter": 32, "activation": "linear", "trainable": true, "b_regularizer": null, "nb_col": 3, "bias": true}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_2"}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_1"}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_1", "border_mode": "valid", "trainable": true, "strides": [2, 2], "dim_ordering": "tf", "pool_size": [2, 2]}}, {"class_name": "Convolution2D", "config": {"nb_row": 3, "W_regularizer": null, "b_constraint": null, "border_mode": "valid", "W_constraint": null, "init": "glorot_uniform", "dim_ordering": "tf", "activity_regularizer": null, "name": "convolution2d_3", "subsample": [1, 1], "nb_filter": 16, "activation": "linear", "trainable": true, "b_regularizer": null, "nb_col": 3, "bias": true}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_3"}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_2"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"W_regularizer": null, "batch_input_shape": [null, 2704], "b_constraint": null, "W_constraint": null, "init": "glorot_uniform", "output_dim": 1024, "input_dtype": "float32", "activity_regularizer": null, "input_dim": 2704, "activation": "linear", "trainable": true, "b_regularizer": null, "name": "dense_1", "bias": true}}, {"class_name": "Dropout", "config": {"p": 0.3, "trainable": true, "name": "dropout_3"}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_4"}}, {"class_name": "Dense", "config": {"W_regularizer": null, "batch_input_shape": [null, 1024], "b_constraint": null, "W_constraint": null, "init": "glorot_uniform", "output_dim": 512, "input_dtype": "float32", "activity_regularizer": null, "input_dim": 1024, "activation": "linear", "trainable": true, "b_regularizer": null, "name": "dense_2", "bias": true}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_5"}}, {"class_name": "Dense", "config": {"W_regularizer": null, "batch_input_shape": [null, 512], "b_constraint": null, "W_constraint": null, "init": "glorot_uniform", "output_dim": 1, "input_dtype": "float32", "activity_regularizer": null, "input_dim": 512, "activation": "linear", "trainable": true, "b_regularizer": null, "name": "dense_3", "bias": true}}], "keras_version": "1.2.0"}