{"keras_version": "1.2.0", "class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"subsample": [1, 1], "batch_input_shape": [null, 160, 320, 3], "b_constraint": null, "nb_filter": 3, "trainable": true, "init": "glorot_uniform", "dim_ordering": "tf", "W_regularizer": null, "border_mode": "same", "nb_col": 1, "activity_regularizer": null, "activation": "relu", "input_dtype": "float32", "b_regularizer": null, "bias": true, "W_constraint": null, "nb_row": 1, "name": "convolution2d_1"}}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "axis": -1, "momentum": 0.99, "mode": 0, "trainable": true, "gamma_regularizer": null, "name": "batchnormalization_1", "beta_regularizer": null}}, {"class_name": "Convolution2D", "config": {"subsample": [2, 2], "nb_filter": 24, "trainable": true, "init": "glorot_uniform", "dim_ordering": "tf", "W_regularizer": null, "b_constraint": null, "nb_col": 5, "activity_regularizer": null, "activation": "relu", "b_regularizer": null, "name": "convolution2d_2", "bias": true, "W_constraint": null, "nb_row": 5, "border_mode": "valid"}}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "axis": -1, "momentum": 0.99, "mode": 0, "trainable": true, "gamma_regularizer": null, "name": "batchnormalization_2", "beta_regularizer": null}}, {"class_name": "Convolution2D", "config": {"subsample": [2, 2], "nb_filter": 36, "trainable": true, "init": "glorot_uniform", "dim_ordering": "tf", "W_regularizer": null, "b_constraint": null, "nb_col": 5, "activity_regularizer": null, "activation": "relu", "b_regularizer": null, "name": "convolution2d_3", "bias": true, "W_constraint": null, "nb_row": 5, "border_mode": "valid"}}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "axis": -1, "momentum": 0.99, "mode": 0, "trainable": true, "gamma_regularizer": null, "name": "batchnormalization_3", "beta_regularizer": null}}, {"class_name": "Convolution2D", "config": {"subsample": [2, 2], "nb_filter": 48, "trainable": true, "init": "glorot_uniform", "dim_ordering": "tf", "W_regularizer": null, "b_constraint": null, "nb_col": 5, "activity_regularizer": null, "activation": "relu", "b_regularizer": null, "name": "convolution2d_4", "bias": true, "W_constraint": null, "nb_row": 5, "border_mode": "valid"}}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "axis": -1, "momentum": 0.99, "mode": 0, "trainable": true, "gamma_regularizer": null, "name": "batchnormalization_4", "beta_regularizer": null}}, {"class_name": "Convolution2D", "config": {"subsample": [1, 1], "nb_filter": 64, "trainable": true, "init": "glorot_uniform", "dim_ordering": "tf", "W_regularizer": null, "b_constraint": null, "nb_col": 3, "activity_regularizer": null, "activation": "relu", "b_regularizer": null, "name": "convolution2d_5", "bias": true, "W_constraint": null, "nb_row": 3, "border_mode": "valid"}}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "axis": -1, "momentum": 0.99, "mode": 0, "trainable": true, "gamma_regularizer": null, "name": "batchnormalization_5", "beta_regularizer": null}}, {"class_name": "Convolution2D", "config": {"subsample": [1, 1], "nb_filter": 64, "trainable": true, "init": "glorot_uniform", "dim_ordering": "tf", "W_regularizer": null, "b_constraint": null, "nb_col": 3, "activity_regularizer": null, "activation": "relu", "b_regularizer": null, "name": "convolution2d_6", "bias": true, "W_constraint": null, "nb_row": 3, "border_mode": "valid"}}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "axis": -1, "momentum": 0.99, "mode": 0, "trainable": true, "gamma_regularizer": null, "name": "batchnormalization_6", "beta_regularizer": null}}, {"class_name": "Convolution2D", "config": {"subsample": [1, 1], "nb_filter": 64, "trainable": true, "init": "glorot_uniform", "dim_ordering": "tf", "W_regularizer": null, "b_constraint": null, "nb_col": 3, "activity_regularizer": null, "activation": "relu", "b_regularizer": null, "name": "convolution2d_7", "bias": true, "W_constraint": null, "nb_row": 3, "border_mode": "valid"}}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "axis": -1, "momentum": 0.99, "mode": 0, "trainable": true, "gamma_regularizer": null, "name": "batchnormalization_7", "beta_regularizer": null}}, {"class_name": "Convolution2D", "config": {"subsample": [1, 1], "nb_filter": 64, "trainable": true, "init": "glorot_uniform", "dim_ordering": "tf", "W_regularizer": null, "b_constraint": null, "nb_col": 3, "activity_regularizer": null, "activation": "relu", "b_regularizer": null, "name": "convolution2d_8", "bias": true, "W_constraint": null, "nb_row": 3, "border_mode": "valid"}}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "axis": -1, "momentum": 0.99, "mode": 0, "trainable": true, "gamma_regularizer": null, "name": "batchnormalization_8", "beta_regularizer": null}}, {"class_name": "Convolution2D", "config": {"subsample": [1, 1], "nb_filter": 64, "trainable": true, "init": "glorot_uniform", "dim_ordering": "tf", "W_regularizer": null, "b_constraint": null, "nb_col": 3, "activity_regularizer": null, "activation": "relu", "b_regularizer": null, "name": "convolution2d_9", "bias": true, "W_constraint": null, "nb_row": 3, "border_mode": "valid"}}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "axis": -1, "momentum": 0.99, "mode": 0, "trainable": true, "gamma_regularizer": null, "name": "batchnormalization_9", "beta_regularizer": null}}, {"class_name": "Convolution2D", "config": {"subsample": [1, 1], "nb_filter": 64, "trainable": true, "init": "glorot_uniform", "dim_ordering": "tf", "W_regularizer": null, "b_constraint": null, "nb_col": 3, "activity_regularizer": null, "activation": "relu", "b_regularizer": null, "name": "convolution2d_10", "bias": true, "W_constraint": null, "nb_row": 3, "border_mode": "valid"}}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "axis": -1, "momentum": 0.99, "mode": 0, "trainable": true, "gamma_regularizer": null, "name": "batchnormalization_10", "beta_regularizer": null}}, {"class_name": "Convolution2D", "config": {"subsample": [1, 1], "nb_filter": 64, "trainable": true, "init": "glorot_uniform", "dim_ordering": "tf", "W_regularizer": null, "b_constraint": null, "nb_col": 3, "activity_regularizer": null, "activation": "relu", "b_regularizer": null, "name": "convolution2d_11", "bias": true, "W_constraint": null, "nb_row": 3, "border_mode": "valid"}}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "axis": -1, "momentum": 0.99, "mode": 0, "trainable": true, "gamma_regularizer": null, "name": "batchnormalization_11", "beta_regularizer": null}}, {"class_name": "Convolution2D", "config": {"subsample": [1, 1], "nb_filter": 64, "trainable": true, "init": "glorot_uniform", "dim_ordering": "tf", "W_regularizer": null, "b_constraint": null, "nb_col": 3, "activity_regularizer": null, "activation": "relu", "b_regularizer": null, "name": "convolution2d_12", "bias": true, "W_constraint": null, "nb_row": 3, "border_mode": "valid"}}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "axis": -1, "momentum": 0.99, "mode": 0, "trainable": true, "gamma_regularizer": null, "name": "batchnormalization_12", "beta_regularizer": null}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"trainable": true, "init": "glorot_uniform", "output_dim": 256, "W_regularizer": null, "b_constraint": null, "activity_regularizer": null, "activation": "relu", "b_regularizer": null, "input_dim": 1344, "bias": true, "W_constraint": null, "name": "dense_1"}}, {"class_name": "Dense", "config": {"trainable": true, "init": "glorot_uniform", "output_dim": 128, "W_regularizer": null, "b_constraint": null, "activity_regularizer": null, "activation": "relu", "b_regularizer": null, "input_dim": 256, "bias": true, "W_constraint": null, "name": "dense_2"}}, {"class_name": "Dense", "config": {"trainable": true, "init": "glorot_uniform", "output_dim": 32, "W_regularizer": null, "b_constraint": null, "activity_regularizer": null, "activation": "relu", "b_regularizer": null, "input_dim": 128, "bias": true, "W_constraint": null, "name": "dense_3"}}, {"class_name": "Dense", "config": {"trainable": true, "init": "glorot_uniform", "output_dim": 1, "W_regularizer": null, "b_constraint": null, "activity_regularizer": null, "activation": "relu", "b_regularizer": null, "input_dim": 32, "bias": true, "W_constraint": null, "name": "dense_4"}}]}