{"class_name": "Sequential", "keras_version": "1.1.2", "config": [{"class_name": "Convolution2D", "config": {"input_dtype": "float32", "init": "glorot_uniform", "subsample": [1, 1], "activation": "relu", "border_mode": "same", "nb_row": 1, "b_regularizer": null, "trainable": true, "bias": true, "activity_regularizer": null, "W_constraint": null, "name": "convolution2d_1", "W_regularizer": null, "batch_input_shape": [null, 160, 320, 3], "nb_filter": 3, "nb_col": 1, "dim_ordering": "tf", "b_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "batchnormalization_1", "mode": 0, "axis": -1, "beta_regularizer": null, "gamma_regularizer": null, "epsilon": 0.001, "trainable": true, "momentum": 0.99}}, {"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "subsample": [2, 2], "border_mode": "valid", "bias": true, "nb_row": 5, "b_regularizer": null, "trainable": true, "activity_regularizer": null, "W_constraint": null, "name": "convolution2d_2", "W_regularizer": null, "activation": "relu", "nb_filter": 24, "nb_col": 5, "dim_ordering": "tf", "b_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "batchnormalization_2", "mode": 0, "axis": -1, "beta_regularizer": null, "gamma_regularizer": null, "epsilon": 0.001, "trainable": true, "momentum": 0.99}}, {"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "subsample": [2, 2], "border_mode": "valid", "bias": true, "nb_row": 5, "b_regularizer": null, "trainable": true, "activity_regularizer": null, "W_constraint": null, "name": "convolution2d_3", "W_regularizer": null, "activation": "relu", "nb_filter": 36, "nb_col": 5, "dim_ordering": "tf", "b_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "batchnormalization_3", "mode": 0, "axis": -1, "beta_regularizer": null, "gamma_regularizer": null, "epsilon": 0.001, "trainable": true, "momentum": 0.99}}, {"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "subsample": [2, 2], "border_mode": "valid", "bias": true, "nb_row": 5, "b_regularizer": null, "trainable": true, "activity_regularizer": null, "W_constraint": null, "name": "convolution2d_4", "W_regularizer": null, "activation": "relu", "nb_filter": 48, "nb_col": 5, "dim_ordering": "tf", "b_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "batchnormalization_4", "mode": 0, "axis": -1, "beta_regularizer": null, "gamma_regularizer": null, "epsilon": 0.001, "trainable": true, "momentum": 0.99}}, {"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "subsample": [1, 1], "border_mode": "valid", "bias": true, "nb_row": 3, "b_regularizer": null, "trainable": true, "activity_regularizer": null, "W_constraint": null, "name": "convolution2d_5", "W_regularizer": null, "activation": "relu", "nb_filter": 64, "nb_col": 3, "dim_ordering": "tf", "b_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "batchnormalization_5", "mode": 0, "axis": -1, "beta_regularizer": null, "gamma_regularizer": null, "epsilon": 0.001, "trainable": true, "momentum": 0.99}}, {"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "subsample": [1, 1], "border_mode": "valid", "bias": true, "nb_row": 3, "b_regularizer": null, "trainable": true, "activity_regularizer": null, "W_constraint": null, "name": "convolution2d_6", "W_regularizer": null, "activation": "relu", "nb_filter": 64, "nb_col": 3, "dim_ordering": "tf", "b_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "batchnormalization_6", "mode": 0, "axis": -1, "beta_regularizer": null, "gamma_regularizer": null, "epsilon": 0.001, "trainable": true, "momentum": 0.99}}, {"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "subsample": [1, 1], "border_mode": "valid", "bias": true, "nb_row": 3, "b_regularizer": null, "trainable": true, "activity_regularizer": null, "W_constraint": null, "name": "convolution2d_7", "W_regularizer": null, "activation": "relu", "nb_filter": 64, "nb_col": 3, "dim_ordering": "tf", "b_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "batchnormalization_7", "mode": 0, "axis": -1, "beta_regularizer": null, "gamma_regularizer": null, "epsilon": 0.001, "trainable": true, "momentum": 0.99}}, {"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "subsample": [1, 1], "border_mode": "valid", "bias": true, "nb_row": 3, "b_regularizer": null, "trainable": true, "activity_regularizer": null, "W_constraint": null, "name": "convolution2d_8", "W_regularizer": null, "activation": "relu", "nb_filter": 64, "nb_col": 3, "dim_ordering": "tf", "b_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "batchnormalization_8", "mode": 0, "axis": -1, "beta_regularizer": null, "gamma_regularizer": null, "epsilon": 0.001, "trainable": true, "momentum": 0.99}}, {"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "subsample": [1, 1], "border_mode": "valid", "bias": true, "nb_row": 3, "b_regularizer": null, "trainable": true, "activity_regularizer": null, "W_constraint": null, "name": "convolution2d_9", "W_regularizer": null, "activation": "relu", "nb_filter": 64, "nb_col": 3, "dim_ordering": "tf", "b_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "batchnormalization_9", "mode": 0, "axis": -1, "beta_regularizer": null, "gamma_regularizer": null, "epsilon": 0.001, "trainable": true, "momentum": 0.99}}, {"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "subsample": [1, 1], "border_mode": "valid", "bias": true, "nb_row": 3, "b_regularizer": null, "trainable": true, "activity_regularizer": null, "W_constraint": null, "name": "convolution2d_10", "W_regularizer": null, "activation": "relu", "nb_filter": 64, "nb_col": 3, "dim_ordering": "tf", "b_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "batchnormalization_10", "mode": 0, "axis": -1, "beta_regularizer": null, "gamma_regularizer": null, "epsilon": 0.001, "trainable": true, "momentum": 0.99}}, {"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "subsample": [1, 1], "border_mode": "valid", "bias": true, "nb_row": 3, "b_regularizer": null, "trainable": true, "activity_regularizer": null, "W_constraint": null, "name": "convolution2d_11", "W_regularizer": null, "activation": "relu", "nb_filter": 64, "nb_col": 3, "dim_ordering": "tf", "b_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "batchnormalization_11", "mode": 0, "axis": -1, "beta_regularizer": null, "gamma_regularizer": null, "epsilon": 0.001, "trainable": true, "momentum": 0.99}}, {"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "subsample": [1, 1], "border_mode": "valid", "bias": true, "nb_row": 3, "b_regularizer": null, "trainable": true, "activity_regularizer": null, "W_constraint": null, "name": "convolution2d_12", "W_regularizer": null, "activation": "relu", "nb_filter": 64, "nb_col": 3, "dim_ordering": "tf", "b_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "batchnormalization_12", "mode": 0, "axis": -1, "beta_regularizer": null, "gamma_regularizer": null, "epsilon": 0.001, "trainable": true, "momentum": 0.99}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "trainable": true, "activity_regularizer": null, "output_dim": 256, "W_constraint": null, "name": "dense_1", "W_regularizer": null, "activation": "relu", "b_constraint": null}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "trainable": true, "activity_regularizer": null, "output_dim": 128, "W_constraint": null, "name": "dense_2", "W_regularizer": null, "activation": "relu", "b_constraint": null}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "trainable": true, "activity_regularizer": null, "output_dim": 32, "W_constraint": null, "name": "dense_3", "W_regularizer": null, "activation": "relu", "b_constraint": null}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "trainable": true, "activity_regularizer": null, "output_dim": 1, "W_constraint": null, "name": "dense_4", "W_regularizer": null, "activation": "relu", "b_constraint": null}}]}