{"class_name": "Sequential", "keras_version": "1.2.1", "config": [{"class_name": "Lambda", "config": {"function_type": "lambda", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\b\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bS)\u0002Ng\u0000\u0000\u0000\u0000\u0000\u00e0o@\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa8/home/carnd/behavioral-cloning/models/nvidia_pipeline.py\u00da\b<lambda>;\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "arguments": {}, "output_shape_type": "raw", "output_shape": null, "batch_input_shape": [null, 90, 320, 3], "input_dtype": "float32", "trainable": true, "name": "lambda_1"}}, {"class_name": "Convolution2D", "config": {"activation": "linear", "nb_filter": 24, "nb_row": 5, "border_mode": "valid", "name": "convolution2d_1", "W_constraint": null, "b_constraint": null, "dim_ordering": "tf", "activity_regularizer": null, "trainable": true, "nb_col": 5, "subsample": [2, 2], "bias": true, "b_regularizer": null, "W_regularizer": null, "init": "he_normal"}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_1"}}, {"class_name": "Convolution2D", "config": {"activation": "linear", "nb_filter": 36, "nb_row": 5, "border_mode": "valid", "name": "convolution2d_2", "W_constraint": null, "b_constraint": null, "dim_ordering": "tf", "activity_regularizer": null, "trainable": true, "nb_col": 5, "subsample": [2, 2], "bias": true, "b_regularizer": null, "W_regularizer": null, "init": "he_normal"}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_2"}}, {"class_name": "BatchNormalization", "config": {"axis": -1, "momentum": 0.99, "mode": 0, "trainable": true, "name": "batchnormalization_1", "epsilon": 0.001, "beta_regularizer": null, "gamma_regularizer": null}}, {"class_name": "Convolution2D", "config": {"activation": "linear", "nb_filter": 48, "nb_row": 5, "border_mode": "valid", "name": "convolution2d_3", "W_constraint": null, "b_constraint": null, "dim_ordering": "tf", "activity_regularizer": null, "trainable": true, "nb_col": 5, "subsample": [2, 2], "bias": true, "b_regularizer": null, "W_regularizer": null, "init": "he_normal"}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_3"}}, {"class_name": "BatchNormalization", "config": {"axis": -1, "momentum": 0.99, "mode": 0, "trainable": true, "name": "batchnormalization_2", "epsilon": 0.001, "beta_regularizer": null, "gamma_regularizer": null}}, {"class_name": "Dropout", "config": {"p": 0.2, "trainable": true, "name": "dropout_1"}}, {"class_name": "Convolution2D", "config": {"activation": "linear", "nb_filter": 64, "nb_row": 3, "border_mode": "valid", "name": "convolution2d_4", "W_constraint": null, "b_constraint": null, "dim_ordering": "tf", "activity_regularizer": null, "trainable": true, "nb_col": 3, "subsample": [1, 1], "bias": true, "b_regularizer": null, "W_regularizer": null, "init": "he_normal"}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_4"}}, {"class_name": "BatchNormalization", "config": {"axis": -1, "momentum": 0.99, "mode": 0, "trainable": true, "name": "batchnormalization_3", "epsilon": 0.001, "beta_regularizer": null, "gamma_regularizer": null}}, {"class_name": "Dropout", "config": {"p": 0.3, "trainable": true, "name": "dropout_2"}}, {"class_name": "Convolution2D", "config": {"activation": "linear", "nb_filter": 64, "nb_row": 3, "border_mode": "valid", "name": "convolution2d_5", "W_constraint": null, "b_constraint": null, "dim_ordering": "tf", "activity_regularizer": null, "trainable": true, "nb_col": 3, "subsample": [1, 1], "bias": true, "b_regularizer": null, "W_regularizer": null, "init": "he_normal"}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_5"}}, {"class_name": "BatchNormalization", "config": {"axis": -1, "momentum": 0.99, "mode": 0, "trainable": true, "name": "batchnormalization_4", "epsilon": 0.001, "beta_regularizer": null, "gamma_regularizer": null}}, {"class_name": "Dropout", "config": {"p": 0.4, "trainable": true, "name": "dropout_3"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"activation": "relu", "input_dim": 8448, "activity_regularizer": null, "name": "dense_1", "W_constraint": null, "b_constraint": null, "output_dim": 100, "trainable": true, "bias": true, "b_regularizer": null, "W_regularizer": null, "init": "he_normal"}}, {"class_name": "BatchNormalization", "config": {"axis": -1, "momentum": 0.99, "mode": 0, "trainable": true, "name": "batchnormalization_5", "epsilon": 0.001, "beta_regularizer": null, "gamma_regularizer": null}}, {"class_name": "Dense", "config": {"activation": "relu", "input_dim": 100, "activity_regularizer": null, "name": "dense_2", "W_constraint": null, "b_constraint": null, "output_dim": 50, "trainable": true, "bias": true, "b_regularizer": null, "W_regularizer": null, "init": "he_normal"}}, {"class_name": "BatchNormalization", "config": {"axis": -1, "momentum": 0.99, "mode": 0, "trainable": true, "name": "batchnormalization_6", "epsilon": 0.001, "beta_regularizer": null, "gamma_regularizer": null}}, {"class_name": "Dense", "config": {"activation": "relu", "input_dim": 50, "activity_regularizer": null, "name": "dense_3", "W_constraint": null, "b_constraint": null, "output_dim": 10, "trainable": true, "bias": true, "b_regularizer": null, "W_regularizer": null, "init": "he_normal"}}, {"class_name": "Dense", "config": {"activation": "linear", "input_dim": 10, "activity_regularizer": null, "name": "dense_4", "W_constraint": null, "b_constraint": null, "output_dim": 1, "trainable": true, "bias": true, "b_regularizer": null, "W_regularizer": null, "init": "he_normal"}}]}