{"keras_version": "1.2.0", "class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"input_dtype": "float32", "function_type": "lambda", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0_@g\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00faC/home/hvrigazov/github/behavioral-cloning/models/nvidia_pipeline.py\u00da\b<lambda>5\u0000\u0000\u0000\u00f3\u0000\u0000\u0000\u0000", null, null], "trainable": true, "output_shape": null, "name": "lambda_1", "batch_input_shape": [null, 64, 64, 3], "arguments": {}, "output_shape_type": "raw"}}, {"class_name": "Convolution2D", "config": {"subsample": [2, 2], "bias": true, "W_regularizer": null, "init": "glorot_uniform", "b_constraint": null, "W_constraint": null, "dim_ordering": "tf", "b_regularizer": null, "activity_regularizer": null, "activation": "linear", "nb_row": 5, "nb_filter": 24, "border_mode": "same", "nb_col": 5, "trainable": true, "name": "convolution2d_1"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_1"}}, {"class_name": "MaxPooling2D", "config": {"dim_ordering": "tf", "trainable": true, "border_mode": "valid", "name": "maxpooling2d_1", "strides": [1, 1], "pool_size": [2, 2]}}, {"class_name": "Convolution2D", "config": {"subsample": [2, 2], "bias": true, "W_regularizer": null, "init": "glorot_uniform", "b_constraint": null, "W_constraint": null, "dim_ordering": "tf", "b_regularizer": null, "activity_regularizer": null, "activation": "linear", "nb_row": 5, "nb_filter": 36, "border_mode": "same", "nb_col": 5, "trainable": true, "name": "convolution2d_2"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_2"}}, {"class_name": "MaxPooling2D", "config": {"dim_ordering": "tf", "trainable": true, "border_mode": "valid", "name": "maxpooling2d_2", "strides": [1, 1], "pool_size": [2, 2]}}, {"class_name": "Convolution2D", "config": {"subsample": [2, 2], "bias": true, "W_regularizer": null, "init": "glorot_uniform", "b_constraint": null, "W_constraint": null, "dim_ordering": "tf", "b_regularizer": null, "activity_regularizer": null, "activation": "linear", "nb_row": 5, "nb_filter": 48, "border_mode": "same", "nb_col": 5, "trainable": true, "name": "convolution2d_3"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_3"}}, {"class_name": "MaxPooling2D", "config": {"dim_ordering": "tf", "trainable": true, "border_mode": "valid", "name": "maxpooling2d_3", "strides": [1, 1], "pool_size": [2, 2]}}, {"class_name": "Convolution2D", "config": {"subsample": [1, 1], "bias": true, "W_regularizer": null, "init": "glorot_uniform", "b_constraint": null, "W_constraint": null, "dim_ordering": "tf", "b_regularizer": null, "activity_regularizer": null, "activation": "linear", "nb_row": 3, "nb_filter": 64, "border_mode": "same", "nb_col": 3, "trainable": true, "name": "convolution2d_4"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_4"}}, {"class_name": "MaxPooling2D", "config": {"dim_ordering": "tf", "trainable": true, "border_mode": "valid", "name": "maxpooling2d_4", "strides": [1, 1], "pool_size": [2, 2]}}, {"class_name": "Convolution2D", "config": {"subsample": [1, 1], "bias": true, "W_regularizer": null, "init": "glorot_uniform", "b_constraint": null, "W_constraint": null, "dim_ordering": "tf", "b_regularizer": null, "activity_regularizer": null, "activation": "linear", "nb_row": 3, "nb_filter": 64, "border_mode": "same", "nb_col": 3, "trainable": true, "name": "convolution2d_5"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_5"}}, {"class_name": "MaxPooling2D", "config": {"dim_ordering": "tf", "trainable": true, "border_mode": "valid", "name": "maxpooling2d_5", "strides": [1, 1], "pool_size": [2, 2]}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"bias": true, "W_regularizer": null, "init": "glorot_uniform", "b_constraint": null, "W_constraint": null, "b_regularizer": null, "trainable": true, "input_dim": 1600, "activation": "linear", "activity_regularizer": null, "output_dim": 1164, "name": "dense_1"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_6"}}, {"class_name": "Dense", "config": {"bias": true, "W_regularizer": null, "init": "glorot_uniform", "b_constraint": null, "W_constraint": null, "b_regularizer": null, "trainable": true, "input_dim": 1164, "activation": "linear", "activity_regularizer": null, "output_dim": 100, "name": "dense_2"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_7"}}, {"class_name": "Dense", "config": {"bias": true, "W_regularizer": null, "init": "glorot_uniform", "b_constraint": null, "W_constraint": null, "b_regularizer": null, "trainable": true, "input_dim": 100, "activation": "linear", "activity_regularizer": null, "output_dim": 50, "name": "dense_3"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_8"}}, {"class_name": "Dense", "config": {"bias": true, "W_regularizer": null, "init": "glorot_uniform", "b_constraint": null, "W_constraint": null, "b_regularizer": null, "trainable": true, "input_dim": 50, "activation": "linear", "activity_regularizer": null, "output_dim": 10, "name": "dense_4"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_9"}}, {"class_name": "Dense", "config": {"bias": true, "W_regularizer": null, "init": "glorot_uniform", "b_constraint": null, "W_constraint": null, "b_regularizer": null, "trainable": true, "input_dim": 10, "activation": "linear", "activity_regularizer": null, "output_dim": 1, "name": "dense_5"}}]}