{"config": [{"config": {"init": "he_normal", "nb_filter": 3, "nb_row": 1, "b_regularizer": null, "activity_regularizer": null, "input_dtype": "float32", "border_mode": "same", "dim_ordering": "tf", "W_constraint": null, "W_regularizer": null, "nb_col": 1, "trainable": true, "name": "convolution2d_1", "batch_input_shape": [null, 66, 200, 3], "activation": "relu", "b_constraint": null, "bias": true, "subsample": [1, 1]}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "p": 0.2, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"mode": 0, "trainable": true, "name": "batchnormalization_1", "epsilon": 0.001, "momentum": 0.99, "gamma_regularizer": null, "axis": -1, "beta_regularizer": null}, "class_name": "BatchNormalization"}, {"config": {"init": "he_normal", "nb_filter": 24, "nb_row": 5, "b_regularizer": null, "activity_regularizer": null, "border_mode": "valid", "dim_ordering": "tf", "W_constraint": null, "W_regularizer": null, "nb_col": 5, "trainable": true, "name": "convolution2d_2", "bias": true, "activation": "linear", "b_constraint": null, "subsample": [2, 2]}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "p": 0.2, "name": "dropout_2"}, "class_name": "Dropout"}, {"config": {"mode": 0, "trainable": true, "name": "batchnormalization_2", "epsilon": 0.001, "momentum": 0.99, "gamma_regularizer": null, "axis": -1, "beta_regularizer": null}, "class_name": "BatchNormalization"}, {"config": {"init": "he_normal", "nb_filter": 36, "nb_row": 5, "b_regularizer": null, "activity_regularizer": null, "border_mode": "valid", "dim_ordering": "tf", "W_constraint": null, "W_regularizer": null, "nb_col": 5, "trainable": true, "name": "convolution2d_3", "bias": true, "activation": "linear", "b_constraint": null, "subsample": [2, 2]}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "p": 0.2, "name": "dropout_3"}, "class_name": "Dropout"}, {"config": {"mode": 0, "trainable": true, "name": "batchnormalization_3", "epsilon": 0.001, "momentum": 0.99, "gamma_regularizer": null, "axis": -1, "beta_regularizer": null}, "class_name": "BatchNormalization"}, {"config": {"init": "he_normal", "nb_filter": 48, "nb_row": 5, "b_regularizer": null, "activity_regularizer": null, "border_mode": "valid", "dim_ordering": "tf", "W_constraint": null, "W_regularizer": null, "nb_col": 5, "trainable": true, "name": "convolution2d_4", "bias": true, "activation": "linear", "b_constraint": null, "subsample": [2, 2]}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "p": 0.2, "name": "dropout_4"}, "class_name": "Dropout"}, {"config": {"mode": 0, "trainable": true, "name": "batchnormalization_4", "epsilon": 0.001, "momentum": 0.99, "gamma_regularizer": null, "axis": -1, "beta_regularizer": null}, "class_name": "BatchNormalization"}, {"config": {"init": "he_normal", "nb_filter": 64, "nb_row": 3, "b_regularizer": null, "activity_regularizer": null, "border_mode": "valid", "dim_ordering": "tf", "W_constraint": null, "W_regularizer": null, "nb_col": 3, "trainable": true, "name": "convolution2d_5", "bias": true, "activation": "linear", "b_constraint": null, "subsample": [1, 1]}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "p": 0.2, "name": "dropout_5"}, "class_name": "Dropout"}, {"config": {"mode": 0, "trainable": true, "name": "batchnormalization_5", "epsilon": 0.001, "momentum": 0.99, "gamma_regularizer": null, "axis": -1, "beta_regularizer": null}, "class_name": "BatchNormalization"}, {"config": {"init": "he_normal", "nb_filter": 64, "nb_row": 3, "b_regularizer": null, "activity_regularizer": null, "border_mode": "valid", "dim_ordering": "tf", "W_constraint": null, "W_regularizer": null, "nb_col": 3, "trainable": true, "name": "convolution2d_6", "bias": true, "activation": "linear", "b_constraint": null, "subsample": [1, 1]}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "p": 0.2, "name": "dropout_6"}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"init": "he_normal", "output_dim": 100, "b_regularizer": null, "activity_regularizer": null, "W_regularizer": null, "b_constraint": null, "W_constraint": null, "trainable": true, "name": "dense_1", "activation": "relu", "bias": true, "input_dim": null}, "class_name": "Dense"}, {"config": {"init": "he_normal", "output_dim": 50, "b_regularizer": null, "activity_regularizer": null, "W_regularizer": null, "b_constraint": null, "W_constraint": null, "trainable": true, "name": "dense_2", "activation": "relu", "bias": true, "input_dim": null}, "class_name": "Dense"}, {"config": {"init": "he_normal", "output_dim": 10, "b_regularizer": null, "activity_regularizer": null, "W_regularizer": null, "b_constraint": null, "W_constraint": null, "trainable": true, "name": "dense_3", "activation": "relu", "bias": true, "input_dim": null}, "class_name": "Dense"}, {"config": {"init": "he_normal", "output_dim": 1, "b_regularizer": null, "activity_regularizer": null, "W_regularizer": null, "b_constraint": null, "W_constraint": null, "trainable": true, "name": "dense_4", "activation": "linear", "bias": true, "input_dim": null}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.1.2"}