{"class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"arguments": {}, "trainable": true, "function_type": "lambda", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e9\u00ff\u0000\u0000\u0000g\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0002\u0000\u0000\u0000r\u0002\u0000\u0000\u0000\u00fa8/home/carnd/behavioral-cloning/models/nvidia_pipeline.py\u00da\b<lambda>:\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "output_shape_type": "raw", "batch_input_shape": [null, 66, 200, 3], "name": "lambda_1", "input_dtype": "float32", "output_shape": null}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "border_mode": "valid", "nb_filter": 24, "activation": "linear", "dim_ordering": "tf", "name": "convolution2d_1", "activity_regularizer": null, "subsample": [2, 2], "nb_col": 5, "W_regularizer": null, "trainable": true, "nb_row": 5, "bias": true, "b_regularizer": null, "init": "glorot_uniform", "b_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_1", "activation": "relu", "trainable": true}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "border_mode": "valid", "nb_filter": 36, "activation": "linear", "dim_ordering": "tf", "name": "convolution2d_2", "activity_regularizer": null, "subsample": [2, 2], "nb_col": 5, "W_regularizer": null, "trainable": true, "nb_row": 5, "bias": true, "b_regularizer": null, "init": "glorot_uniform", "b_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_2", "activation": "relu", "trainable": true}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "border_mode": "valid", "nb_filter": 48, "activation": "linear", "dim_ordering": "tf", "name": "convolution2d_3", "activity_regularizer": null, "subsample": [2, 2], "nb_col": 5, "W_regularizer": null, "trainable": true, "nb_row": 5, "bias": true, "b_regularizer": null, "init": "glorot_uniform", "b_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_3", "activation": "relu", "trainable": true}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "border_mode": "valid", "nb_filter": 64, "activation": "linear", "dim_ordering": "tf", "name": "convolution2d_4", "activity_regularizer": null, "subsample": [1, 1], "nb_col": 3, "W_regularizer": null, "trainable": true, "nb_row": 3, "bias": true, "b_regularizer": null, "init": "glorot_uniform", "b_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_4", "activation": "relu", "trainable": true}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "border_mode": "valid", "nb_filter": 64, "activation": "linear", "dim_ordering": "tf", "name": "convolution2d_5", "activity_regularizer": null, "subsample": [1, 1], "nb_col": 3, "W_regularizer": null, "trainable": true, "nb_row": 3, "bias": true, "b_regularizer": null, "init": "glorot_uniform", "b_constraint": null}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "p": 0.5}}, {"class_name": "Activation", "config": {"name": "activation_5", "activation": "relu", "trainable": true}}, {"class_name": "Dense", "config": {"W_constraint": null, "activation": "linear", "b_constraint": null, "name": "dense_1", "activity_regularizer": null, "bias": true, "init": "glorot_uniform", "trainable": true, "output_dim": 100, "b_regularizer": null, "W_regularizer": null, "input_dim": 1152}}, {"class_name": "Activation", "config": {"name": "activation_6", "activation": "relu", "trainable": true}}, {"class_name": "Dense", "config": {"W_constraint": null, "activation": "linear", "b_constraint": null, "name": "dense_2", "activity_regularizer": null, "bias": true, "init": "glorot_uniform", "trainable": true, "output_dim": 50, "b_regularizer": null, "W_regularizer": null, "input_dim": 100}}, {"class_name": "Activation", "config": {"name": "activation_7", "activation": "relu", "trainable": true}}, {"class_name": "Dense", "config": {"W_constraint": null, "activation": "linear", "b_constraint": null, "name": "dense_3", "activity_regularizer": null, "bias": true, "init": "glorot_uniform", "trainable": true, "output_dim": 10, "b_regularizer": null, "W_regularizer": null, "input_dim": 50}}, {"class_name": "Activation", "config": {"name": "activation_8", "activation": "relu", "trainable": true}}, {"class_name": "Dense", "config": {"W_constraint": null, "activation": "linear", "b_constraint": null, "name": "dense_4", "activity_regularizer": null, "bias": true, "init": "glorot_uniform", "trainable": true, "output_dim": 1, "b_regularizer": null, "W_regularizer": null, "input_dim": 10}}], "keras_version": "1.2.1"}