{"class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"input_dtype": "float32", "trainable": true, "output_shape_type": "raw", "function_type": "lambda", "name": "lambda_1", "batch_input_shape": [null, 22, 64, 1], "output_shape": null, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0o@g\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00faE/home/hvrigazov/github/behavioral-cloning/models/comma_ai_pipeline.py\u00da\b<lambda>F\u0000\u0000\u0000\u00f3\u0000\u0000\u0000\u0000", null, null], "arguments": {}}}, {"class_name": "Convolution2D", "config": {"nb_row": 3, "nb_col": 3, "trainable": true, "bias": true, "dim_ordering": "tf", "W_regularizer": null, "activity_regularizer": null, "subsample": [2, 2], "border_mode": "same", "init": "glorot_uniform", "b_constraint": null, "W_constraint": null, "name": "convolution2d_1", "b_regularizer": null, "nb_filter": 16, "activation": "linear"}}, {"class_name": "ELU", "config": {"name": "elu_1", "alpha": 1.0, "trainable": true}}, {"class_name": "Convolution2D", "config": {"nb_row": 3, "nb_col": 3, "trainable": true, "bias": true, "dim_ordering": "tf", "W_regularizer": null, "activity_regularizer": null, "subsample": [1, 1], "border_mode": "same", "init": "glorot_uniform", "b_constraint": null, "W_constraint": null, "name": "convolution2d_2", "b_regularizer": null, "nb_filter": 8, "activation": "linear"}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "trainable": true, "border_mode": "valid", "name": "maxpooling2d_1", "strides": [2, 2], "dim_ordering": "tf"}}, {"class_name": "ELU", "config": {"name": "elu_2", "alpha": 1.0, "trainable": true}}, {"class_name": "Convolution2D", "config": {"nb_row": 3, "nb_col": 3, "trainable": true, "bias": true, "dim_ordering": "tf", "W_regularizer": null, "activity_regularizer": null, "subsample": [1, 1], "border_mode": "same", "init": "glorot_uniform", "b_constraint": null, "W_constraint": null, "name": "convolution2d_3", "b_regularizer": null, "nb_filter": 4, "activation": "linear"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "p": 0.2, "trainable": true}}, {"class_name": "Dense", "config": {"input_dim": 320, "bias": true, "b_regularizer": null, "trainable": true, "W_regularizer": null, "activity_regularizer": null, "init": "glorot_uniform", "b_constraint": null, "W_constraint": null, "name": "dense_1", "output_dim": 512, "activation": "linear"}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "p": 0.4, "trainable": true}}, {"class_name": "ELU", "config": {"name": "elu_3", "alpha": 1.0, "trainable": true}}, {"class_name": "Dense", "config": {"input_dim": 512, "bias": true, "b_regularizer": null, "trainable": true, "W_regularizer": null, "activity_regularizer": null, "init": "glorot_uniform", "b_constraint": null, "W_constraint": null, "name": "dense_2", "output_dim": 1, "activation": "linear"}}], "keras_version": "1.2.0"}