{"class_name": "Sequential", "keras_version": "1.2.0", "config": [{"class_name": "Convolution2D", "config": {"W_constraint": null, "bias": true, "input_dtype": "float32", "subsample": [1, 1], "batch_input_shape": [null, 160, 320, 3], "trainable": true, "border_mode": "same", "W_regularizer": null, "init": "glorot_uniform", "nb_filter": 3, "activation": "relu", "activity_regularizer": null, "dim_ordering": "tf", "b_constraint": null, "nb_row": 1, "nb_col": 1, "name": "convolution2d_1", "b_regularizer": null}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "bias": true, "subsample": [2, 2], "trainable": true, "border_mode": "valid", "W_regularizer": null, "init": "glorot_uniform", "nb_filter": 24, "activation": "relu", "activity_regularizer": null, "dim_ordering": "tf", "b_constraint": null, "nb_row": 5, "nb_col": 5, "name": "convolution2d_2", "b_regularizer": null}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "bias": true, "subsample": [2, 2], "trainable": true, "border_mode": "valid", "W_regularizer": null, "init": "glorot_uniform", "nb_filter": 36, "activation": "relu", "activity_regularizer": null, "dim_ordering": "tf", "b_constraint": null, "nb_row": 5, "nb_col": 5, "name": "convolution2d_3", "b_regularizer": null}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "bias": true, "subsample": [2, 2], "trainable": true, "border_mode": "valid", "W_regularizer": null, "init": "glorot_uniform", "nb_filter": 48, "activation": "relu", "activity_regularizer": null, "dim_ordering": "tf", "b_constraint": null, "nb_row": 5, "nb_col": 5, "name": "convolution2d_4", "b_regularizer": null}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "bias": true, "subsample": [1, 1], "trainable": true, "border_mode": "valid", "W_regularizer": null, "init": "glorot_uniform", "nb_filter": 64, "activation": "relu", "activity_regularizer": null, "dim_ordering": "tf", "b_constraint": null, "nb_row": 3, "nb_col": 3, "name": "convolution2d_5", "b_regularizer": null}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "bias": true, "subsample": [1, 1], "trainable": true, "border_mode": "valid", "W_regularizer": null, "init": "glorot_uniform", "nb_filter": 64, "activation": "relu", "activity_regularizer": null, "dim_ordering": "tf", "b_constraint": null, "nb_row": 3, "nb_col": 3, "name": "convolution2d_6", "b_regularizer": null}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "bias": true, "subsample": [1, 1], "trainable": true, "border_mode": "valid", "W_regularizer": null, "init": "glorot_uniform", "nb_filter": 64, "activation": "relu", "activity_regularizer": null, "dim_ordering": "tf", "b_constraint": null, "nb_row": 3, "nb_col": 3, "name": "convolution2d_7", "b_regularizer": null}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "bias": true, "subsample": [1, 1], "trainable": true, "border_mode": "valid", "W_regularizer": null, "init": "glorot_uniform", "nb_filter": 64, "activation": "relu", "activity_regularizer": null, "dim_ordering": "tf", "b_constraint": null, "nb_row": 3, "nb_col": 3, "name": "convolution2d_8", "b_regularizer": null}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "bias": true, "subsample": [1, 1], "trainable": true, "border_mode": "valid", "W_regularizer": null, "init": "glorot_uniform", "nb_filter": 64, "activation": "relu", "activity_regularizer": null, "dim_ordering": "tf", "b_constraint": null, "nb_row": 3, "nb_col": 3, "name": "convolution2d_9", "b_regularizer": null}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "bias": true, "subsample": [1, 1], "trainable": true, "border_mode": "valid", "W_regularizer": null, "init": "glorot_uniform", "nb_filter": 64, "activation": "relu", "activity_regularizer": null, "dim_ordering": "tf", "b_constraint": null, "nb_row": 3, "nb_col": 3, "name": "convolution2d_10", "b_regularizer": null}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "bias": true, "subsample": [1, 1], "trainable": true, "border_mode": "valid", "W_regularizer": null, "init": "glorot_uniform", "nb_filter": 64, "activation": "relu", "activity_regularizer": null, "dim_ordering": "tf", "b_constraint": null, "nb_row": 3, "nb_col": 3, "name": "convolution2d_11", "b_regularizer": null}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "bias": true, "subsample": [1, 1], "trainable": true, "border_mode": "valid", "W_regularizer": null, "init": "glorot_uniform", "nb_filter": 64, "activation": "relu", "activity_regularizer": null, "dim_ordering": "tf", "b_constraint": null, "nb_row": 3, "nb_col": 3, "name": "convolution2d_12", "b_regularizer": null}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"W_constraint": null, "bias": true, "input_dim": 1344, "output_dim": 256, "W_regularizer": null, "init": "glorot_uniform", "b_regularizer": null, "activation": "relu", "activity_regularizer": null, "b_constraint": null, "trainable": true, "name": "dense_1"}}, {"class_name": "Dense", "config": {"W_constraint": null, "bias": true, "input_dim": 256, "output_dim": 128, "W_regularizer": null, "init": "glorot_uniform", "b_regularizer": null, "activation": "relu", "activity_regularizer": null, "b_constraint": null, "trainable": true, "name": "dense_2"}}, {"class_name": "Dense", "config": {"W_constraint": null, "bias": true, "input_dim": 128, "output_dim": 32, "W_regularizer": null, "init": "glorot_uniform", "b_regularizer": null, "activation": "relu", "activity_regularizer": null, "b_constraint": null, "trainable": true, "name": "dense_3"}}, {"class_name": "Dense", "config": {"W_constraint": null, "bias": true, "input_dim": 32, "output_dim": 1, "W_regularizer": null, "init": "glorot_uniform", "b_regularizer": null, "activation": "relu", "activity_regularizer": null, "b_constraint": null, "trainable": true, "name": "dense_4"}}]}